Repository: sifadil/PCSX2
Catalog: trunk/locales/*/pcsx2_Iconized.po
Languages: sv_se

source: This hack works best for games that use the INTC Status register to wait for vsyncs, which includes primarily non-3D RPG titles. Games that do not use this method of vsync will see little or no speedup from this hack.
sv_se: Denna fix fungerar bäst för spel som använder INTC-statusregistret för att invänta Vsync'ar, vilket främst omfattar icke-3D-RPG titlar. Spel som inte använder denna Vsync-metod kommer på sin höjd att få en liten uppsnabbning.

source: Primarily targetting the EE idle loop at address 0x81FC0 in the kernel, this hack attempts to detect loops whose bodies are guaranteed to result in the same machine state for every iteration until a scheduled event triggers emulation of another unit. After a single iteration of such loops, we advance to the time of the next event or the end of the processor's timeslice, whichever comes first.
sv_se: Främst inriktat på EE-tomgångsloop hos adress 0x81FC0 i kärnan, försöker denna fix att upptäcka loopar vars kroppar garanterat medför samma maskintillstånd vid varje upprepning tills en schemalagd händelse utlöser emulering av en annan enhet. Efter en enskild upprepning av en sådan loop, avancerar Vi till tiden för nästa händelse eller till slutet av processorns tidskvantum, vilket som än kommer först.

source: Check HDLoader compatibility lists for known games that have issues with this. (Often marked as needing 'mode 1' or 'slow DVD'
sv_se: Undersök HD-laddarförenlighetslistan för spel som till vetskap kommer till fråga med det här (ofta markerat som behövande ''läge 1'' eller ''långsam DVD'').

source: Note that when Framelimiting is disabled, Turbo and SlowMotion modes will not be available either.
sv_se: Bemärk att när Bildbegränsning är förhindrad så kommer Turbo och SlowMotion lägena inte att vara tillgängliga heller.

source: Notice: Due to PS2 hardware design, precise frame skipping is impossible. Enabling it will cause severe graphical errors in some games.
sv_se: Bemärk: Till följd av PS2's hårdvaruutformning så är precist bildöverhoppande omöjligt. Att tillämpa det kan orsaka rejäla grafikfel för vissa spel.

source: Enable this if you think MTGS thread sync is causing crashes or graphical errors.
sv_se: Tillämpa detta ifall Ni tror att MTGS-trådsync orsakar braker eller grafiska fel.

source: Removes any benchmark noise caused by the MTGS thread or GPU overhead. This option is best used in conjunction with savestates: save a state at an ideal scene, enable this option, and re-load the savestate. Warning: This option can be enabled on-the-fly but typically cannot be disabled on-the-fly (video will typically be garbage).
sv_se: Tar bort allt norm-oljud orsakat av MTGS-trådens eler GPU'ns överdrag. Denna tillämpning används bäst i förening med sparpunkter: spara ett tillstånd i en idealisk scen, tillämpa denna funktion, och återladda sedan sparpunkten. Varning: Denna tillämpning kan möjliggöras dynamiskt men kan vanligtvis inte förhindras på samma vis (video blir ofta skräp).

source: Your system is too low on virtual resources for PCSX2 to run. This can be caused by having a small or disabled swapfile, or by other programs that are hogging resources.
sv_se: Ert system har för lite virtuella resurser för att PCSX2 ska kunna köras. Detta kan ha orsakats av att ha en liten eller förhindrad bytfil, eller av att andra program tar för sig av systemets resurser.

source: Out of Memory (sorta): The SuperVU recompiler was unable to reserve the specific memory ranges required, and will not be available for use. This is not a critical error, since the sVU rec is obsolete, and you should use microVU instead anyway. :)
sv_se: Slut på Minne (typ): superVU-omkompileraren var oförmögen att reservera den mängd särskilda minne som krävs, och kommer inte vara tillgänglig för bruk. Detta är inte ett kritiskt fel eftersom sVU är föråldrad, och följdaktligen borde Ni hur som helst använda Er av microVU istället.
