Repository: sifadil/PCSX2
Catalog: trunk/locales/*/pcsx2_Iconized.po
Languages: sv_se

source: There is not enough virtual memory available, or necessary virtual memory mappings have already been reserved by other processes, services, or DLLs.
sv_se: Det finns inte tillräckligt med virtuellt minne tillgängligt, eller så har den nödvändiga virtuella minnestilldelningen redan blivit reserverat av andra processer, tjänster eller DLL'er.

source: Playstation game discs are not supported by PCSX2. If you want to emulate PSX games then you'll have to download a PSX-specific emulator, such as ePSXe or PCSX.
sv_se: PlayStation®One speldiskar stödjes inte av PCSX2. Om Ni vill emulera PSX-spel får Ni använda en särskild PSX-emulator, såsom ePSXe eller PCSX.

source: This recompiler was unable to reserve contiguous memory required for internal caches. This error can be caused by low virtual memory resources, such as a small or disabled swapfile, or by another program that is hogging a lot of memory. You can also try reducing the default cache sizes for all PCSX2 recompilers, found under Host Settings.
sv_se: Denna omkompilerare var oförmögen att reservera det angränsande minne som krävs för inhemska förråd, ett fel som kan ha orsakats av låga Virtuella Maskin resurser, såsom en liten eller förhindrad bytfil, eller av att ett annat program tar för sig mycket minne. Ni kan annars pröva minska förvalsförrådsstorleken för PCSX2's alla omkompilerare, vilket kan göras genom ''Värdinställningar''.

source: PCSX2 is unable to allocate memory needed for the PS2 virtual machine. Close out some memory hogging background tasks and try again.
sv_se: PCSX2 är oförmögen att tilldela det minne som krävs för PS2's Virtuella Maskin. Stäng minneskrävande bakgrundsprogram och försök igen.

source: Warning: Your computer does not support SSE2, which is required by many PCSX2 recompilers and plugins. Your options will be limited and emulation will be *very* slow.
sv_se: Varning: Er dator stödjer inte SSE2, vilket krävs för många av PCSX2's omkompilerare och insticksprogram. Era möjligheter kommer vara begränsade och emuleringen blir *mycket* långsam.

source: Warning: Some of the configured PS2 recompilers failed to initialize and have been disabled:
sv_se: Varning: Några av de konfigurerade PS2-omkompilerarna misslyckades att initialiseras och har blivit förhindrade:

source: Note: Recompilers are not necessary for PCSX2 to run, however they typically improve emulation speed substantially. You may have to manually re-enable the recompilers listed above, if you resolve the errors.
sv_se: Bemärk: Omkompilerare är inte nödvändiga för att PCSX2 ska kunna köras, men de förbättrar oftast emuleringshastigheten avsevärt. Ni kanske måste återmöjliggöra omkompileraren ovanför manuellt, om Ni löser felen.

source: PCSX2 requires a PS2 BIOS in order to run. For legal reasons, you *must* obtain a BIOS from an actual PS2 unit that you own (borrowing doesn't count). Please consult the FAQs and Guides for further instructions.
sv_se: PCSX2 kräver PS2 BIOS för att köras. Av juridiska skäl *måste* Ni anskaffa ett BIOS från en faktisk PS2-enhet som Ni äger (tillåns gäller inte). Undersök FAQ'er och Guider för ytterligare information.

source: 'Ignore' to continue waiting for the thread to respond. 'Cancel' to attempt to cancel the thread. 'Terminate' to quit PCSX2 immediately.
sv_se: ''Ignorera'' för att fortsätta vänta på trådarna att svara. ''Avbryt'' för att försöka avbryta tråden. ''Avsluta'' för att avsluta PCSX2 omedelebart.

source: Please ensure that these folders are created and that your user account is granted write permissions to them -- or re-run PCSX2 with elevated (administrator) rights, which should grant PCSX2 the ability to create the necessary folders itself. If you do not have elevated rights on this computer, then you will need to switch to User Documents mode (click button below).
sv_se: Försäkra Er om att dessa mappar är skapade och att Er Användarbehörighet medger skrivning för dem -- eller återkör PCSX2 med upphöjd (Administratörs) behörighet, vilket borde medge PCSX2 förmågan att skapa de nödvändiga mapparna självt. Om Ni inte har upphöjd behörighet för Er dator, får Ni byta till AnvändarDokument-läge (klicka på knappen nedanför).

source: NTFS compression can be changed manually at any time by using file properties from Windows Explorer.
sv_se: NTFS-komprimering kan ändras manuellt när som helst genom att använda filegenskaper hos Windows Explorer.

source: This is the folder where PCSX2 saves your settings, including settings generated by most plugins (some older plugins may not respect this value).
sv_se: Detta är mappen där PCSX2 sparar Era inställningar, och då även inställningar skapade av de flesta insticksprogram (gäller måhända dock inte för vissa äldre insticksprogram).

source: You may optionally specify a location for your PCSX2 settings here. If the location contains existing PCSX2 settings, you will be given the option to import or overwrite them.
sv_se: Ni kan förslagsvis ange en placering för Era PCSX2-inställningar här. Om placeringen innehåller befintliga PCSX2-inställningar kommer Ni ges möjlighet att importera och överskriva.

source: This wizard will help guide you through configuring plugins, memory cards, and BIOS. It is recommended if this is your first time installing %s that you view the readme and configuration guide.
sv_se: Denna trollkarl kommer att hjälpleda Er genom konfigurationsinsticksprogram, minneskort och BIOS. Ifall detta är första gången Ni installerar %s, Anrådes Ni att undersöka ''Läs mig'' och ''KonfigurationsVägledningen''.

source: PCSX2 requires a *legal* copy of the PS2 BIOS in order to run games. You cannot use a copy obtained from a friend or the Internet. You must dump the BIOS from your *own* Playstation 2 console.
sv_se: PCSX2 kräver *lagligt* PS2 BIOS för att köra spel. Ni får inte använda en kopia anförskaffat genom en vän eller Internet. Ni måste dumpa BIOS'et från Er *egna* PlayStation®2 konsol.

source: Existing %s settings have been found in the configured settings folder. Would you like to import these settings or overwrite them with %s default values? (or press Cancel to select a different settings folder)
sv_se: Befintliga %s-inställningar har hittats i Konfigurationsinställningsmappen. Vill Ni importera dessa inställningar och överskriva %s's förval med dem? (eller tryck ''Avbryt'' för att välja en annan mapp)

source: NTFS compression is built-in, fast, and completely reliable; and typically compresses memory cards very well (this option is highly recommended).
sv_se: NTFS-komprimering är inbyggt, snabbt, och helt tillförlitligt; det komprimerar vanligtvis minneskort mycket bra (denna tillämpning Anrådes tydligt).

source: Avoids memory card corruption by forcing games to re-index card contents after loading from savestates. May not be compatible with all games (Guitar Hero).
sv_se: Undviker minneskortsförstörelse genom att tvinga spel att återindexera kortinnehåll efter att ha laddat från sparpunkt. Måhända inte förenligt med alla spel (''Guitar Hero'').

source: The thread '%s' is not responding. It could be deadlocked, or it might just be running *really* slowly.
sv_se: Tråden ''%s'' svarar inte. Den kan ha gått i baklås, eller kör kanske bara *väldigt* långsamt.

source: Warning! You are running PCSX2 with command line options that override your configured settings. These command line options will not be reflected in the Settings dialog, and will be disabled if you apply any changes here.
sv_se: Varning! Ni tillämpar PCSX2 med åsidosättning av Era konfigurationsinställningar. Detta åskådliggörs inte i Inställningar, och kommer att förhindras om Ni tillämpar några förändringar här.

source: Warning! You are running PCSX2 with command line options that override your configured plugin and/or folder settings. These command line options will not be reflected in the settings dialog, and will be disabled when you apply settings changes here.
sv_se: Varning! Ni tillämpar PCSX2 med åsidosättning av Era insticks- och/eller mappkonfigurationsinställningar. Detta åskådliggörs inte i Inställningar, och kommer att förhindras om Ni tillämpar inställningsförändringar här.

source: The Presets apply speed hacks, some recompiler options and some game fixes known to boost speed. Known important game fixes will be applied automatically. Presets info: 1 - The most accurate emulation but also the slowest. 3 --> Tries to balance speed with compatibility. 4 - Some more aggressive hacks. 6 - Too many hacks which will probably slow down most games.
sv_se: Förinställningarna tillämpar snabbfixar, några omkompilerarfunktioner, och en del spelfixar som till vetskap ökar farten. Spelfixar som till vetskap är viktiga (''Patchar'') kommer tillämpas automatiskt. Förinställningsinfo: 1 - Det riktigaste emuleringen, men också den långsammaste. 3 --> Försöker balansera hastighet med förenlighet. 4 - Några mer aggresiva fixar. 6 - För många fixar kommer förmodligen att sakta ner de flesta spel.

source: The Presets apply speed hacks, some recompiler options and some game fixes known to boost speed. Known important game fixes will be applied automatically. --> Uncheck to modify settings manually (with current preset as base)
sv_se: Förinställningarna tillämpar snabbfixar, några omkompilerarfunktioner, och en del spelfixar som till vetskap höjer farten. Spelfixar som till vetskap är viktiga (''Patchar'') kommer tillämpas automatiskt. --> Avmarkera för att ändra inställningarna manuellt (med nuvarande inställningar som bas).

source: This action will reset the existing PS2 virtual machine state; all current progress will be lost. Are you sure?
sv_se: Detta kommer att återställa det befintliga Virtuella Maskin PS2-tillståndet; alla nuvarande processer kommer at förloras. Är Ni säker?

source: This command clears %s settings and allows you to re-run the First-Time Wizard. You will need to manually restart %s after this operation. WARNING!! Click OK to delete *ALL* settings for %s and force-close the app, losing any current emulation progress. Are you absolutely sure? (note: settings for plugins are unaffected)
sv_se: Detta rensar %s-inställningarna och låter Er att återköra ''Första gången Trollkarlen''. Ni får återstarta %s manuellt efter detta. VARNING! Tryck ''Vidare'' för att rensa *ALLA* inställningar för %s och tvångstänga programmet, med följd att alla nuvarande emuleringsprocesser mistes. Bemärk: Inställningar för insticksprogram påverkas ej. Är Ni helt säker?

source: The PS2-slot %d has been automatically disabled. You can correct the problem and re-enable it at any time using Config:Memory cards from the main menu.
sv_se: Minneskortet i sockel %d har blivit automatiskt förhindrat. Ni kan åtgärda problemet och återmöjliggöra minneskortet när som helst genom Konfig:Minneskort i huvudmenyn.

source: Please select a valid BIOS. If you are unable to make a valid selection then press Cancel to close the Configuration panel.
sv_se: Välj ett giltligt BIOS. Är Ni oförmögen att göra detta så tryck ''Avbryt'' för att stänga Konfigurationspanelen.

source: Notice: Most games are fine with the default options.
sv_se: EE = Emotion Engine = Rörelse Motor IOP = Input Output Processor = In Ut Processor Bemärk: De flesta spel har det fint med förvalssättningarna.

source: Notice: Most games are fine with the default options.
sv_se: VM = Virtual Machine = Virtuell Maskin VU = Vector Unit = Vektor Enhet Bemärk: De flesta spel har det fint med förvalssättningarna.

source: The specified path/directory does not exist. Would you like to create it?
sv_se: Den angivna sökvägen/katalogen finns ej. Vill Ni skapa den?

source: When checked this folder will automatically reflect the default associated with PCSX2's current usermode setting.
sv_se: När markerad kommer denna mapp automatiskt att fungera enligt förvalen förknippade med PCSX2's nuvarande användarinställningar.

source: Zoom = 100: Fit the entire image to the window without any cropping. Above/Below 100: Zoom In/Out 0: Automatic-Zoom-In untill the black-bars are gone (Aspect ratio is kept, some of the image goes out of screen). NOTE: Some games draw their own black-bars, which will not be removed with '0'. Keyboard: CTRL + NUMPAD-PLUS: Zoom-In, CTRL + NUMPAD-MINUS: Zoom-Out, CTRL + NUMPAD-*: Toggle 100/0
sv_se: Zoom = 100.0: Anpassa hela bilden till fönstret utan beskärning. Över/Under 100.0: Zooma in/ut. Bemärk: Zoom-värdet återställs inte automatiskt; det sparas i konfigurationsfilen, och tillämpas nästa gång Ni använder PCSX2. Zoom = 0.0: Automatisk inzoomning tills de svarta räckena är borta (bildkvot bevaras, en del av bilden går utanför fönstret). Bemärk: Vissa spel ritar sina egna svarta räcken vilka inte tas bort med ''0.0''. Tangentbord: ''Ctrl'' + ''NumPad Plus'': Inzoomning ''Ctrl'' + ''NumPad Minus'': Utzoomning ''Ctrl'' + ''NumPad Stjärna'': Växla 100/0

source: Vsync eliminates screen tearing but typically has a big performance hit. It usually only applies to fullscreen mode, and may not work with all GS plugins.
sv_se: Vsync slår ut skärmsönderrivning men har oftast en stor prestationseffekt. Det tillämpas vanligtvis bara i helskärmsläge, och kanske inte fungerar för alla GS-insticksprogram.

source: Enables Vsync when the framerate is exactly at full speed. Should it fall below that, Vsync gets disabled to avoid further performance penalties. Note: This currently only works well with GSdx as GS plugin and with it configured to use DX10/11 hardware rendering. Any other plugin or rendering mode will either ignore it or produce a black frame that blinks whenever the mode switches. It also requires Vsync to be enabled.
sv_se: Möjliggör Vsync när bildfrekvensen är precis på full hastighet. Skulle den falla under denna så förhindras Vsync för att undvika vidare prestandastraff. Bemärk: Detta fungerar för närvarande bara bra med GSdx som GS-insticksprogram, och med konfigurationen DX10/11 Hårdvaruframställning. Annat insticksprogram eller framställningssätt kommer antingen att ignoreras eller alstra en svart skärm som blinkar när läget byts. Tillämpningen kräver även att Vsync möjliggörs.

source: Check this to force the mouse cursor invisible inside the GS window; useful if using the mouse as a primary control device for gaming. By default the mouse auto-hides after 2 seconds of inactivity.
sv_se: Markera för att tvinga muspekaren att bli osynlig när den är i ett GS-fönster; användbart vid brukande av musen som främsta styrmojäng för spelande. Som förval gömmer sig muspekaren automatiskt efter 2 sekunders stillastående.

source: Enables automatic mode switch to fullscreen when starting or resuming emulation. You can still toggle fullscreen display at any time using alt-enter.
sv_se: Möjliggör automatiskt lägesbyte till fullskärm när emulering statas eller återupptas. Ni kan ännu växla mellan helskärm och fönsterläge genom att trycka ''Alt'' + ''Enter''.

source: Completely closes the often large and bulky GS window when pressing ESC or pausing the emulator.
sv_se: Stänger helt det ofta stora och omfångsrika GS-fönstret när Ni trycker på ''Esc'' eller avbryter emulatorn.

source: Known to affect following games: * Digital Devil Saga (Fixes FMV and crashes) * SSX (Fixes bad graphics and crashes) * Resident Evil: Dead Aim (Causes garbled textures)
sv_se: Påverkar till vetskap följande spel: * ''Digital Devil Saga'' (fixar FMV och brakar) * ''SSX'' (fixar dålig grafik och brakar) * ''Resident Evil: Dead Aim'' (orsakar förvrängda texturer)

source: Known to affect following games: * Bleach Blade Battler * Growlanser II and III * Wizardry
sv_se: Påverkar till vetskap följande spel: * ''Bleach Blade Battler'' * ''Growlanser II & III'' * ''Wizardry''

source: Known to affect following games: * Mana Khemia 1 (Going "off campus")
sv_se: Påverkar till vetskap följande spel: * ''Mana Khemia 1'' (går "bortom behörighet")

source: Known to affect following games: * Test Drive Unlimited * Transformers
sv_se: Påverkar till vetskap följande spel: * ''Test Drive Unlimited'' * ''Transformers''

source: Gamefixes can work around wrong emulation in some titles. They may also cause compatibility or performance issues. It's better to enable 'Automatic game fixes' at the main menu instead, and leave this page empty. ('Automatic' means: selectively use specific tested fixes for specific games)
sv_se: Spelfixar kan åtgärda felaktig emulering för vissa titlar. De kan dock orsaka förenlighets- eller prestandaproblem. Ni får stänga av Spelfixar manuellt när Ni byter spel. Det är i allmänhet bättre att förhindra denna tillämpning, och att möjliggöra ''Automatiska Spelfixar'' i huvudmenyn (''Automatiska'' innebär: använd särskilt utvalda och beprövade lösningar för särskilda spel).

source: Failed: Duplicate is only allowed to an empty PS2-Port or to the file system.
sv_se: Misslyckades: Dubblering är endast tillåtet till en tom PS2-sockel, eller till ett filsystem.

source: Please select your preferred default location for PCSX2 user-level documents below (includes memory cards, screenshots, settings, and savestates). These folder locations can be overridden at any time using the Core Settings panel.
sv_se: Välj Ert föredragna mål för PCSX2's Användarnivå Dokument nedanför (innefattar minneskort, skärmbilder, inställningar, och sparpunkter). Detta kan ändras när som helst genom Kärninställningspanelen.

source: You can change the preferred default location for PCSX2 user-level documents here (includes memory cards, screenshots, settings, and savestates). This option only affects Standard Paths which are set to use the installation default value.
sv_se: Ni kan ändra det föredragna förvalsmålet för PCSX2's Användarnivå Dokument här (innefattar minneskort, skärmbilder, inställningar, och sparpunkter). Detta påverkar bara StandardSökvägarna vilka ställs in för att använda installationsförvalsvärdena.

source: This folder is where PCSX2 records savestates; which are recorded either by using menus/toolbars, or by pressing F1/F3 (save/load).
sv_se: I denna mapp sparar PCSX2 sparpunkter, vilka antingen görs genom användning av menyer/verktygsrad, eller genom att trycka på ''F1''/''F3'' (spara/ladda).

source: This folder is where PCSX2 saves screenshots. Actual screenshot image format and style may vary depending on the GS plugin being used.
sv_se: I denna mapp sparar PCSX2 skärmbilder. Det faktiska skärmbildsformatet och stilen kan variera beroende på vilket GS-insticksprogram som används.

source: This folder is where PCSX2 saves its logfiles and diagnostic dumps. Most plugins will also adhere to this folder, however some older plugins may ignore it.
sv_se: I denna mapp sparar PCSX2 sina loggfiler och diagnostiska rapporter. De flesta insticksprogram håller sig till denna mapp, men en del äldre kan försumma den.

source: Warning! Changing plugins requires a complete shutdown and reset of the PS2 virtual machine. PCSX2 will attempt to save and restore the state, but if the newly selected plugins are incompatible the recovery may fail, and current progress will be lost. Are you sure you want to apply settings now?
sv_se: Varning! Att byta insticksprogram kräver en full nedstängning och återställning av PS2's Virtuella Maskin. PCSX2 kommer att försöka att spara och återställa tillståndet, men om de nyligen valda insticksprogrammen är oförenliga kan detta misslyckas, och alla nuvarande framsteg kommer att förloras. Är Ni säker att Ni vill tillämpa ändringarna nu?

source: All plugins must have valid selections for %s to run. If you are unable to make a valid selection due to missing plugins or an incomplete install of %s, then press Cancel to close the Configuration panel.
sv_se: Alla insticksprogram måste ha giltliga inställningar för att %s ska kunna köras. Är Ni oförmögen att göra detta till följd av saknade insticksprogram eller en ofullständig installaion av %s, så tryck ''Avbryt'' för att stänga Konfigurationspanelen.

source: 1 - Default cyclerate. This closely matches the actual speed of a real PS2 EmotionEngine.
sv_se: 1 - Förvalscykelgrad. Detta överensstämmer nästan med den faktiska hastigheten för en PS2-EE.

source: 2 - Reduces the EE's cyclerate by about 33%. Mild speedup for most games with high compatibility.
sv_se: 2 - Minskar EE's cykelgrad med ungefär 33%. Mild uppsnabbning och hög förenlighet för de flesta spel.

source: 3 - Reduces the EE's cyclerate by about 50%. Moderate speedup, but *will* cause stuttering audio on many FMVs.
sv_se: 3 - Minskar EE's cykelgrad med ungefär 50%. Måttfull uppsnabbning, men *kommer* att orsaka stamningsljud för många FMV'er.

source: 0 - Disables VU Cycle Stealing. Most compatible setting!
sv_se: 0 - Förhndrar VU-cykelstöld. Den mest förenliga inställningen!

source: 1 - Mild VU Cycle Stealing. Lower compatibility, but some speedup for most games.
sv_se: 1 - Mild VU-cykelstöld. Lägre förenlighet, men en viss uppsnabbning för de flesta spel.

source: 2 - Moderate VU Cycle Stealing. Even lower compatibility, but significant speedups in some games.
sv_se: 2 - Måttfull VU-cykelstöld. Ännu lägre förenlighet, men en markant uppsnabbning för vissa spel.

source: 3 - Maximum VU Cycle Stealing. Usefulness is limited, as this will cause flickering visuals or slowdown in most games.
sv_se: 3 - Maximal VU-cykelstöld. Begränsad användning, eftersom tillämpning orsakar synligt flimrande för de flesta spel.

source: Speedhacks usually improve emulation speed, but can cause glitches, broken audio, and false FPS readings. When having emulation problems, disable this panel first.
sv_se: Snabbfixar förbättrar vanligtvis emuleringshastigheten, men kan orsaka trassel, brutet ljud, och falska FPS-avläsningar. Förhindra denna panel det första Ni gör vid emuleringsproblem.

source: Setting higher values on this slider effectively reduces the clock speed of the EmotionEngine's R5900 core cpu, and typically brings big speedups to games that fail to utilize the full potential of the real PS2 hardware.
sv_se: Att sätta ett högre värde genom denna manick minskar verkningsfullt klockhastigheten hos EE'ns R5900 kärn-CPU, och ger oftast en hög hastghetsökning till spel som misslyckas att nyttja möjligheterna med PS2's verkliga hårdvara fullt ut.

source: This slider controls the amount of cycles the VU unit steals from the EmotionEngine. Higher values increase the number of cycles stolen from the EE for each VU microprogram the game runs.
sv_se: Denna manick styr mängden cykler som VU-enheten stjäl ifrån EE'n. Högre värden ökar antalet cykler som stjäls från EE'n per VU-microprogram spelet kör.

source: Updates Status Flags only on blocks which will read them, instead of all the time. This is safe most of the time, and Super VU does something similar by default.
sv_se: Uppdaterar endast Statusflaggor för block som kommer att läsa dem, istället för alltid. Detta är för det mesta säkert, och Super-VU gör något liknande som standard.

source: Runs VU1 on its own thread (microVU1-only). Generally a speedup on CPUs with 3 or more cores. This is safe for most games, but a few games are incompatible and may hang. In the case of GS limited games, it may be a slowdown (especially on dual core CPUs).
sv_se: Kör VU1 i dess egna tråd (endast microVU1). I allmänhet en uppsnabbning för CPU'er med 3 eller fler kärnor. Detta är säkert för de flesta spel, men en del är oförenliga och kan hänga. Vad gäller GS-begränsade spel, kan en nedbromsning förekomma (i synnerhet för dubbelkärniga CPU'er).
